Учет_кабельной_продукции/src/Documents/МонтажКабельнойПродукции/МонтажКабельнойПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МонтажКабельнойПродукции</name>
  <basedOn>Document.ЗаявкиНаЗакупки</basedOn>
  <registerRecords>InformationRegister.ДанныеПоМонтажуКабельнойПродукции</registerRecords>
  <attributes>
    <name>ОтчетОМонтаже</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИКЖЧерновик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтчетаОМонтаже</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналУчетаКабельнойПродукции</name>
    <type>
      <types>CatalogRef.ЖурналыУчетаКабельнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявкиНаМонтаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.Подрядчик</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаФактическая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_кабельной_продукции/src/Documents/МонтажКабельнойПродукции/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда		
		МодульУправленияДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправленияДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		
	Если Параметры.Ключ.Пустая() Тогда   

		Если Параметры.Свойство("ЖурналУчетаКабельнойПродукции") Тогда
			Объект.ЖурналУчетаКабельнойПродукции = Параметры.ЖурналУчетаКабельнойПродукции;	
		КонецЕсли;
		
		Если Параметры.Свойство("Подрядчик") Тогда
			Объект.Подрядчик = Параметры.Подрядчик;	
		КонецЕсли;
				
		ИнициализироватьРеквизитыОбъекта(); 
		
		Если Параметры.Свойство("ЭтоРабочееМесто") Тогда
			
			Объект.Дата = ТекущаяДата();
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизитыОбъекта()

	Объект.Статус = Перечисления.СтатусыЗаявкиНаМонтаж.ВРаботе;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;	
	КонецЕсли;
	
	ОповеститьОВыборе(Объект.Ссылка);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандыФормы
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры  

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтаФорма, Команда);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыполнитьМонтаж(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыМонтажа.Выполнен");	  
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;	
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыМонтажа.ВРаботе");	
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры
#КонецОбласти

#Область СобытияПолейФормы
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)   
	
	Если ЭтоИзменениеТекущегоМонтажа() Тогда
		Записать();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетОМонтажеПриИзменении(Элемент) 

	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)

	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИКЖЧерновикПриИзменении(Элемент) 

	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаОМонтажеПриИзменении(Элемент)   
	
	Если ЭтоИзменениеТекущегоМонтажа() Тогда
		Записать();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДлинаФактическаяПриИзменении(Элемент)

	Если ЭтоИзменениеТекущегоМонтажа() Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЭтоИзменениеТекущегоМонтажа() Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоИзменениеТекущегоМонтажа()
	
	Возврат ЗначениеЗаполнено(Объект.Ссылка);
	
КонецФункции
#КонецОбласти
